from fastapi import FastAPI
from fastapi.responses import FileResponse
import random
import os

app = FastAPI()

# ======================
# AI 回答池（隨機但穩定）
# ======================
answers = [
    "單腳拉屎很危險 單腳拉屎 dangerous。",
   "運動系統、神經系統、內分泌系統、循環系統、呼吸系統、消化系統、泌尿系統、生殖系統。",
    "結論很簡單：沒有結論。",
    "「超解」此詞為魔物獵人中，充能斧技能「超高壓屬性解放斬」的簡稱，還可以進行三種強化，其中一種為盾強化模式（紅盾），由高壓屬性解放斬改出，一次性把所有的充好的瓶都消耗掉，能夠提高屬性解放斬的傷害。此外，這樣還會把高壓屬性解放斬變成「超高壓屬性解放斬」（簡稱超解），前搖變得更大，多了一個360度橫斬動作，之後在攻擊落下時根據當前瓶的數量，製造同等數量的瓶爆炸。需要注意的是：這一招不論是否命中，都會一次性消耗掉所有的瓶，所以不要輕易使用。。",
    "你嚇得我的多力多滋撒了一地▼▲►▼▲►▼▼▲▼▲►▼▲►▼▲►▼▲►▼▲►▼▼▲►▼►▼▲►▼▼▲►▼▲►▼▲►▼▼►▼▲►▼▲►▼▼▲▼▲►▼▲►▼►▼▲►▼▲►▼▲▲►▼▲►▼►▼▲▼▲►▼▲▲►▼►▼嗚嗚嗚賠我的多力多滋，賠我的多力多滋 。"
]

# ======================
# API
# ======================
@app.get("/search")
def search(q: str = ""):
    return {
        "query": q,
        "answer": random.choice(answers)
    }

# ======================
# UI
# ======================
@app.get("/")
def home():
    return FileResponse("static/index.html")
